
## Plan Result (terraform/agent/dev/global/client-user-verification/s3)

[CI link](https://github.com/mileslee-nsuslab/tfaction-example/actions/runs/5996479810)


<pre><code>Plan: 1 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * aws_s3_bucket.example


<details><summary>Change Result (Click me)</summary>

```hcl

  # aws_s3_bucket.example will be created
  + resource "aws_s3_bucket" "example" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = "tfaction-bucket-3423"
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags                        = {
          + "Environment" = "Dev"
          + "Name"        = "My bucket"
        }
      + tags_all                    = {
          + "Environment" = "Dev"
          + "Name"        = "My bucket"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.
```

</details>




## :warning: Errors

* add a label terraform/agent/dev/global/client-user-verification/s3/add-or-update: POST https://api.github.com/repos/mileslee-nsuslab/tfaction-example/issues/28/labels: 422 Validation Failed [{Resource:Label Field:name Code:invalid Message:}]
<!-- github-comment: {"Command":"plan","JobName":"terraform-plan","PRNumber":28,"Program":"tfcmt","SHA1":"2084066f0e4994157c6cb00da617e3868a7fe9df","Target":"terraform/agent/dev/global/client-user-verification/s3","Vars":{},"WorkflowName":"test"} -->